## Production: alert_compromise
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                    |
|--------|---------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_subscription_filter.broadcast_alert_lambda_logfilter` |
|        | `aws_iam_role.group_broadcast_alert_role`                                 |
|        | `aws_iam_role_policy.publish_to_sns`                                      |
|        | `aws_lambda_function.broadcast_alert`                                     |
|        | `aws_lambda_permission.broadcast_alert_lambda_permission`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.broadcast_alert_lambda_logfilter will be created
  + resource "aws_cloudwatch_log_subscription_filter" "broadcast_alert_lambda_logfilter" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + filter_pattern  = "Secret detected"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/github-secret-scanning-api"
      + name            = "broadcast_alert_lambda_logfilter"
      + role_arn        = (known after apply)
    }

  # aws_iam_role.group_broadcast_alert_role will be created
  + resource "aws_iam_role" "group_broadcast_alert_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ]
      + max_session_duration  = 3600
      + name                  = "group_broadcast_alert_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.publish_to_sns will be created
  + resource "aws_iam_role_policy" "publish_to_sns" {
      + id     = (known after apply)
      + name   = "publish_to_sns"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sns:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:ca-central-1:283582579564:internal-sre-alert"
                      + Sid      = "AllowSnsActions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_lambda_function.broadcast_alert will be created
  + resource "aws_lambda_function" "broadcast_alert" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Notify other teams that their API keys have been compromised."
      + filename                       = "/tmp/broadcast_alert.py.zip"
      + function_name                  = "broadcast_alert"
      + handler                        = "broadcast_alert.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = 10
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "CVqp1pf4CXZTEVS7JbfZXGYu9rwTIJLXeeXOr+mn6iM="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "sns_topic_arn" = "arn:aws:sns:ca-central-1:283582579564:internal-sre-alert"
              + "subject"       = "Notify API key has been leaked"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_permission.broadcast_alert_lambda_permission will be created
  + resource "aws_lambda_permission" "broadcast_alert_lambda_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "logs.ca-central-1.amazonaws.com"
      + source_arn          = "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/github-secret-scanning-api:*"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.group_broadcast_alert_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.broadcast_alert"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
